app/controllers/api/v1/patients_controller.rb

    def create
      user = User.find_by(id: params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1